tutorials/heatTransfer/chtMultiRegionFoam/multiRegionLiquidHeater/system/bottomWater/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    U
    {
        internalField   uniform (0.001 0 0);

        boundaryField
        {
            minX
            {
                type            fixedValue;
                value           uniform (0.001 0 0);
            }

            maxX
            {
                type            inletOutlet;
                inletValue      uniform (0 0 0);
            }

            ".*"
            {
                type            fixedValue;
                value           uniform (0 0 0);
            }
        }
    }

    T
    {
        internalField   uniform 300;

        boundaryField
        {
            minX
            {
                type            fixedValue;
                value           uniform 300;
            }

            maxX
            {
                type            inletOutlet;
                inletValue      uniform 300;
            }

            ".*"
            {
                type            zeroGradient;
            }

            "bottomWater_to_.*"
            {
                type            compressible::turbulentTemperatureCoupledBaffle;
                neighbourFieldName T;
                K               K;
                value           uniform 300;
            }
        }
    }

    epsilon
    {
        internalField   uniform 0.01;

        boundaryField
        {
            minX
            {
                type            fixedValue;
                value           uniform 0.01;
            }

            maxX
            {
                type            inletOutlet;
                inletValue      uniform 0.01;
            }

            ".*"
            {
                type            compressible::epsilonWallFunction;
                value           uniform 0.01;
            }
        }
    }

    k
    {
        internalField   uniform 0.1;

        boundaryField
        {
            minX
            {
                type            inletOutlet;
                inletValue      uniform 0.1;
            }

            maxX
            {
                type            zeroGradient;
            }

            ".*"
            {
                type            compressible::kqRWallFunction;
                value           uniform 0.1;
            }
        }
    }

    p_rgh
    {
        internalField   uniform 0;

        boundaryField
        {
            minX
            {
                type            zeroGradient;
            }

            maxX
            {
                type            fixedValue;
                value           uniform 0;
            }

            ".*"
            {
                type            buoyantPressure;
                value           uniform 0;
            }
        }
    }

    p
    {
        internalField   uniform 0;

        boundaryField
        {
            ".*"
            {
                type            calculated;
                value           uniform 0;
            }
        }
    }
}

// ************************************************************************* //
